In [4]:
import pandas as pd
import numpy as np

Database style dataframe merges

In [8]:
df1 = pd.DataFrame({'key': ['b','b','a','c','a','a','b'], 'data1':range(7)})
df2 = pd.DataFrame({'key': ['a','b','d'],'data2':range(3)})

In [12]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [13]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [17]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [18]:
pd.merge(df1,df2, on= 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [19]:
df3 = pd.DataFrame({'lkey': ['b','b','a','c','a','a','b'], 'data1':range(7)})
df4 = pd.DataFrame({'rkey': ['a','b','d'],'data2':range(3)})

In [21]:
pd.merge(df3,df4, left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [24]:
pd.merge(df1,df2,how ='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [27]:
df1 = pd.DataFrame({'key' :['b','b','a','c','a','b'],'data1':range(6)})
df2 = pd.DataFrame({'key': ['a','b','a','b','d'],'data2':range(5)})

In [32]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [33]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [35]:
pd.merge(df1, df2,on = 'key',how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [36]:
pd.merge(df1, df2,on = 'key',how = 'right')

   key  data1  data2
0    b    0.0      1
1    b    1.0      1
2    b    5.0      1
3    b    0.0      3
4    b    1.0      3
5    b    5.0      3
6    a    2.0      0
7    a    4.0      0
8    a    2.0      2
9    a    4.0      2
10   d    NaN      4